using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Bank
{
    internal class Program
    {
        static void Main(string[] args)
        {
            Console.CursorVisible = false;
            Console.Title = "Sber";
            string[] names = new string[]
            {
                "Иван", "Петр", "Алексей", "Дмитрий", "Сергей", "Андрей", "Николай", "Александр", "Михаил", "Владимир",
                "Игорь", "Олег", "Артем", "Евгений", "Антон", "Анатолий", "Роман", "Денис", "Виктор", "Георгий",
                "Арсений", "Борис", "Егор", "Илья", "Константин", "Максим", "Руслан", "Семен", "Тимур", "Ярослав"
            };

            string[] surnames = new string[]
            {
                "Иванов", "Петров", "Смирнов", "Соколов", "Михайлов", "Федоров", "Соловьев", "Лебедев", "Козлов", "Новиков",
                "Морозов", "Павлов", "Волков", "Алексеев", "Семенов", "Егоров", "Петухов", "Николаев", "Сидоров", "Кузнецов",
                "Ковалев", "Зайцев", "Соловьёв", "Васильев", "Захаров", "Андреев", "Козлов", "Григорьев", "Борисов", "Максимов"
            };

            string[] patronymics = new string[]
            {
                "Иванович", "Петрович", "Алексеевич", "Дмитриевич", "Сергеевич", "Андреевич", "Николаевич", "Александрович", "Михайлович", "Владимирович",
                "Игоревич", "Олегович", "Артемович", "Евгеньевич", "Антонович", "Анатольевич", "Романович", "Денисович", "Викторович", "Георгиевич",
                "Арсеньевич", "Борисович", "Егорович", "Ильич", "Константинович", "Максимович", "Русланович", "Семенович", "Тимурович", "Ярославович"
            };

            Bank Sber = new Bank();

            Sber.MainMenu(names,surnames,patronymics);

        }
    }
}
